Revit 2027 API
KeyBasedTreeEntries.FindEntry Method
 Finds the KeyBasedTreeEntry associated with the given key value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public KeyBasedTreeEntry FindEntry(
	string key
)
Public Function FindEntry (
	key As String
) As KeyBasedTreeEntry
public:
KeyBasedTreeEntry^ FindEntry(
	String^ key
)
member FindEntry :
        key : string -> KeyBasedTreeEntry
Parameters
key String
 The specified key value.
Return Value
KeyBasedTreeEntry
 The KeyBasedTreeEntry corresponds to the given key value.
Exceptions
Exception | Condition
ArgumentException |  key is an empty string.
ArgumentNullException |  A non-optional argument was null
Remarks
 If no matching KeyBasedTreeEntry can be found, null will be returned; The given key value cannot be an empty string.
See Also
Reference
KeyBasedTreeEntries Class
Autodesk.Revit.DB Namespace